//ArrayList를 활용하여 상점을 만들어보자!
//구매, 판매, 목록보기
//소지금, 물건의 구매가 등을 지정해서 적정 버튼을 누르면 처리되도록 만들어봅시다!
//초기에 판매리스트에는 아무것도 없다.
//초기에는 상점 주인이 파는 구매 리스트만 존재한다.
//물건을 구매하면 구매한 물품이 판매 리스트에 보인다.
//목록 보기는 단순히 현재 소지한 물건 리스트만 보여준다.

import java.util.Scanner;

/*
    - 설계 -
    1. 데이터 : 판매중인 목록, 물품 가격, 팔린 목록, 상점 매출액, 고객 지출액, 장바구니, Scanner
    2. 메소드 : 소지금계산, 판매시 판매리스트에 추가, 구매시 장바구니에 추가
    3. 초기화 설정 : 고객 소지금 10만원, 상점 매출액 0원, 판매 할 물품, 물품가격

    4. 팔린 목록,장바구니(ArrayList) : 물품을 구매해야지만 값이 추가됨 .add()
    5. 물건 판매시 상점소지금 +=가격, 고객소지금-=가격
*/
class store {
    Scanner scan;


    public store() {

    }



}

public class homework_prob51 {
}
