public class Quiz10 {
//    10번 문제 : 관계 연산자 문제
    public static void main(String[] args) {
        int A = 700 , B = 240, D= 350;
        int C = 30, F =500;


//        if((C<=?)||(F<=?)) {
//            System.out.printf();
//        ||(OR) : C 혹은 F 둘 중 하나라도 참이라면 참입니다
//                효율적으로 케이스를 찾아내기 위해서는 30개의 데이터만을 가지고 있는 C를 앞에 배치하였을때,
//                500개(데이터 F)를 찾기전에, 참으로 판단되어 결과값이 나옵니다

//        1. 데이터 30개, 500개, 240개 ...인데 int를 사용하는 것이 맞을까요?
//        2. 맞다면 if((C<=?)||(F<=?))에서 ?에 어떤 숫자가 들어가야 하는지, 전체적으로 고민이 됩니다.
//


    }
}
