public class Comment {
    //for문 안에 있는 i, j 는 for문 안에서만 사용한다.
    //밖에 있는 i,j는 for문 밖에서도 출력이 가능하다. 출력의 형태는 다르겠지만.
    //randNum뒤에 숫자를 빼는 것은 메모리를 아끼기 위해서라고함.
    //때론 직접 숫자를 입력하는 것보다 변수를 설정하고 입력(숫자가 대입된)하는 게 훨씬 효율적이다.
    //#####다른 사람 코드도 참고해보자(조금씩들 다르게 썼음)
    //변수를 2개쓰면 메모리 효율면에서는 낮고, 속도는?
    //for문 안에 i 썼는데 i는 뭐지? 단순히 10번 반복을 위한 것일 뿐. i가 for문에 있든 없든 작동함.
    //#####질문노트 쓸때 내 코드캡쳐한거 왼쪽에 올리고, 오른쪽에 설명 쓰거나 질문하기
    //#####정리를 잘 해야 한다! 모든 걸 다 캡쳐하고 붙여넣고, 가설도 써보고...
    //Math.random()에 곱하는 숫자가 결국 나올 수 있는 숫자의 범위 개수다.
    //즉 검사 횟수가 11번인데 범위의 개수는 4개이므로
    //영원히 반복하게 된다.
    //쉬프트 연산에 사용되는 int 데이터 타입은 32비트임을 잊지맙시다!
    //14<<4--->224---->0000 1110
    //쉬프트 연산자 사용과 이진법 변환하는 법을 까먹지 않기!
    //#####PDF자료 너무 작게 나와서, 폰트 크기를 키워서 써야 할듯.
    //
}
