public class Quiz_18_19 {
    public static void main(String[] args) {
        //18번 : 21을 이진수로 표현
        // 16(2^4) + 8(2^3) + 4(2^2) + 2(2^1) + 1(2^0)
        //    1        0       1          0        1
        // 1, 3, 5 번째지만
        // 실제 표현할땐 0번비트, 2번비트, 4번비트로 표현해주도록 한다

        //19번 :  73을 이진수로 표현
        //64(2^6) + 32(2^5) + 16(2^4) + 8(2^3) + 4(2^2) + 2(2^1) + 1(2^0)
        //    1       0          0         1        0        0        1
        // 0번비트. 3번비트, 6번비트로 표현함





    }
}
