public class Homework {
    public static void main(String[] args) {
        /*
        1000개의 데이터가 있다.
        여기서 C에 해당하는 데이터는 30개 있다.
        F에 해당하는 데이터는 500개 있다.
        B에 해당하는 데이터는 240개 있다.
        A에 해당하는 데이터는 700개 있다.
        D에 해당하는 데이터는 350개 있다.
        C 혹은 F 둘 중 하나의 케이스를 판정하고자 한다.
        어떻게 하면 가장 효율적으로 이 케이스들을 찾아낼 수 있을까 고민해보자!
         */


        int data= 1000;

        int A_data=700;
        int B_data=240;
        int C_data=30;
        int D_data=350;
        int F_data=500;

        //문제를 통해 내가 알고있는 부분 :
        //data가 1000개,
        //각 데이터들의 수,
        //각 데이터들의 합 = 1820
        //820에 해당하는 만큼의 교집합이 있을것으로 예상됨...?

        //C 혹은 F 둘 중 하나의 케이스를 판정하고자 한다. -> 여기서 OR 관계연산자를 사용하라고 힌트를 주셨음.

        //모르겠습니다..


    }
}

