public class ChallengeQuiz {
    public static void main(String[] args) {
        //1000개의 데이터가 있다.
        //여기서 C에 해당하는 데이터는 30개 있다.
        //F에 해당하는 데이터는 500개 있다.
        //B에 해당하는 데이터는 240개 있다.
        //A에 해당하는 데이터는 700개 있다.
        //D에 해당하는 데이터는 350개 있다.
        //C 혹은 F 둘 중 하나의 케이스를 판정하고자 한다.
        //어떻게 하면 가장 효율적으로 이 케이스들을 찾아낼 수 있을까 고민해보자!

        int c = 30;
        int f = 500;
        int b = 240;
        int a = 700;
        int d = 350;
        // 풀어 보려 했지만 실패했습니다.. 검색도했는데 도통 모르겠네요 ..
        // if조건문으로 중간숫자의 데이터인 b보다 작은 c를 비교연산해서 true만들고
        // &&논리연산자로 f보다 큰 a를 비교 해서
        // true로 찾아낸다 .... ㅠㅠ 머릿속에 든거로는 이게 최선인거같아요 활용을 못하겠네요..
                if((b>c)&&(f<a)){
                }

    }
}
